# Navie Bayes

This is ued to classification
when IDV is cate and DV is cate
Its classify the records on the basis of probability

In [1]:
import pandas as pd
from sklearn import preprocessing
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix
from sklearn.model_selection import train_test_split

In [14]:
df = pd.read_csv('train.csv')

In [15]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [49]:
y=df['Survived']

In [50]:
x = df.drop(['PassengerId','Name','Ticket','Cabin','Survived'],axis=1)

In [19]:
x.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [20]:
enc = preprocessing.LabelEncoder()

In [21]:
new_sex = enc.fit_transform(df['Sex'])

In [22]:
new_emb = enc.fit_transform(df['Embarked'])

In [51]:
df['Sex'] = new_sex
df['Embarked'] = new_emb

In [52]:
x.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  22.0      1      0   7.2500         2
1       1    0  38.0      1      0  71.2833         0
2       3    0  26.0      0      0   7.9250         2
3       1    0  35.0      1      0  53.1000         2
4       3    1  35.0      0      0   8.0500         2

In [25]:
x.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [26]:
from sklearn.naive_bayes import BernoulliNB

In [53]:
x_train,X_test,y_train,y_test = train_test_split(x,y,test_size=0.3,random_state=0)

In [54]:
x_train.shape

(622, 7)

In [30]:
X_test.shape

(267, 7)

In [55]:
clf = BernoulliNB()

In [56]:
y_pred = clf.fit(x_train,y_train).predict(X_test)

In [57]:
confusion_matrix(y_test,y_pred)

array([[131,  26],
       [ 35,  75]], dtype=int64)

In [34]:
accuracy_score(y_test,y_pred,normalize=True)

0.7715355805243446

In [35]:
x.columns

Index(['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked'], dtype='object')

Change in Dependent variable
    
    1. DV - 'Pclass'
    2. IDV - 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked','Survived'

In [58]:
x = df.drop(['PassengerId','Name','Ticket','Cabin','Pclass'],axis=1)
y= df['Pclass']

In [65]:
x.head()

   Survived  Sex   Age  SibSp  Parch     Fare  Embarked
0         0    1  22.0      1      0   7.2500         2
1         1    0  38.0      1      0  71.2833         0
2         1    0  26.0      0      0   7.9250         2
3         1    0  35.0      1      0  53.1000         2
4         0    1  35.0      0      0   8.0500         2

In [59]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size = 0.3,random_state=0)

In [62]:
clf = BernoulliNB()

In [63]:
y_pred = clf.fit(x_train,y_train).predict(x_test)

In [43]:
accuracy_score(y_test,y_pred,)

0.5917602996254682

In [64]:
confusion_matrix(y_test,y_pred)

array([[ 30,   8,  32],
       [  9,  10,  30],
       [ 24,   6, 118]], dtype=int64)

Change in DV

    1. DV - 'Embarked'
    2. IDV - 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Pclass','Survived'

In [67]:
x = x = df.drop(['PassengerId','Name','Ticket','Cabin','Embarked'],axis=1)
y= df['Embarked']

In [68]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.3,random_state= 0)

In [69]:
y_pred = clf.fit(x_train,y_train).predict(x_test)

In [70]:
accuracy_score(y_test,y_pred)

0.7340823970037453

In [71]:
confusion_matrix(y_test,y_pred)

array([[  0,   0,  49],
       [  0,   0,  22],
       [  0,   0, 196]], dtype=int64)

In [72]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2